{"token2id": {"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "<SEP>": 3, "<UNK>": 4, "<MASK>": 5, "<GENRE_ROCK>": 6, "<GENRE_POP>": 7, "<GENRE_FUNK>": 8, "<GENRE_JAZZ>": 9, "<GENRE_LATIN>": 10, "<GENRE_CLASSICAL>": 11, "<GENRE_ELECTRONIC>": 12, "<MOOD_HAPPY>": 13, "<MOOD_SAD>": 14, "<MOOD_DARK>": 15, "<MOOD_RELAXED>": 16, "<MOOD_TENSE>": 17, "<ENERGY_LOW>": 18, "<ENERGY_MED>": 19, "<ENERGY_HIGH>": 20, "<TIMESIG_3_4>": 21, "<TIMESIG_4_4>": 22, "<TIMESIG_6_8>": 23, "<KEY_C_MAJ>": 24, "<KEY_C_MIN>": 25, "<KEY_Cs_MAJ>": 26, "<KEY_Cs_MIN>": 27, "<KEY_D_MAJ>": 28, "<KEY_D_MIN>": 29, "<KEY_Ds_MAJ>": 30, "<KEY_Ds_MIN>": 31, "<KEY_E_MAJ>": 32, "<KEY_E_MIN>": 33, "<KEY_F_MAJ>": 34, "<KEY_F_MIN>": 35, "<KEY_Fs_MAJ>": 36, "<KEY_Fs_MIN>": 37, "<KEY_G_MAJ>": 38, "<KEY_G_MIN>": 39, "<KEY_Gs_MAJ>": 40, "<KEY_Gs_MIN>": 41, "<KEY_A_MAJ>": 42, "<KEY_A_MIN>": 43, "<KEY_As_MAJ>": 44, "<KEY_As_MIN>": 45, "<KEY_B_MAJ>": 46, "<KEY_B_MIN>": 47, "<TEMPO_60>": 48, "<TEMPO_80>": 49, "<TEMPO_100>": 50, "<TEMPO_120>": 51, "<TEMPO_140>": 52, "<TEMPO_160>": 53, "<TEMPO_180>": 54, "<TEMPO_200>": 55, "<BAR_1>": 56, "<BAR_2>": 57, "<BAR_3>": 58, "<BAR_4>": 59, "<BAR_5>": 60, "<BAR_6>": 61, "<BAR_7>": 62, "<BAR_8>": 63, "<BAR_9>": 64, "<BAR_10>": 65, "<BAR_11>": 66, "<BAR_12>": 67, "<BAR_13>": 68, "<BAR_14>": 69, "<BAR_15>": 70, "<BAR_16>": 71, "<BAR_17>": 72, "<BAR_18>": 73, "<BAR_19>": 74, "<BAR_20>": 75, "<BAR_21>": 76, "<BAR_22>": 77, "<BAR_23>": 78, "<BAR_24>": 79, "<BAR_25>": 80, "<BAR_26>": 81, "<BAR_27>": 82, "<BAR_28>": 83, "<BAR_29>": 84, "<BAR_30>": 85, "<BAR_31>": 86, "<BAR_32>": 87, "<BEAT_1>": 88, "<BEAT_2>": 89, "<BEAT_3>": 90, "<BEAT_4>": 91, "<POS_0>": 92, "<POS_1>": 93, "<POS_2>": 94, "<POS_3>": 95, "<POS_4>": 96, "<POS_5>": 97, "<POS_6>": 98, "<POS_7>": 99, "<POS_8>": 100, "<POS_9>": 101, "<POS_10>": 102, "<POS_11>": 103, "<POS_12>": 104, "<POS_13>": 105, "<POS_14>": 106, "<POS_15>": 107, "<POS_16>": 108, "<POS_17>": 109, "<POS_18>": 110, "<POS_19>": 111, "<POS_20>": 112, "<POS_21>": 113, "<POS_22>": 114, "<POS_23>": 115, "<POS_24>": 116, "<POS_25>": 117, "<POS_26>": 118, "<POS_27>": 119, "<POS_28>": 120, "<POS_29>": 121, "<POS_30>": 122, "<POS_31>": 123, "<POS_32>": 124, "<POS_33>": 125, "<POS_34>": 126, "<POS_35>": 127, "<POS_36>": 128, "<POS_37>": 129, "<POS_38>": 130, "<POS_39>": 131, "<POS_40>": 132, "<POS_41>": 133, "<POS_42>": 134, "<POS_43>": 135, "<POS_44>": 136, "<POS_45>": 137, "<POS_46>": 138, "<POS_47>": 139, "<POS_48>": 140, "<POS_49>": 141, "<POS_50>": 142, "<POS_51>": 143, "<POS_52>": 144, "<POS_53>": 145, "<POS_54>": 146, "<POS_55>": 147, "<POS_56>": 148, "<POS_57>": 149, "<POS_58>": 150, "<POS_59>": 151, "<POS_60>": 152, "<POS_61>": 153, "<POS_62>": 154, "<POS_63>": 155, "<INST_PIANO>": 156, "<INST_BASS>": 157, "<INST_GUITAR>": 158, "<PITCH_28>": 159, "<PITCH_29>": 160, "<PITCH_30>": 161, "<PITCH_31>": 162, "<PITCH_32>": 163, "<PITCH_33>": 164, "<PITCH_34>": 165, "<PITCH_35>": 166, "<PITCH_36>": 167, "<PITCH_37>": 168, "<PITCH_38>": 169, "<PITCH_39>": 170, "<PITCH_40>": 171, "<PITCH_41>": 172, "<PITCH_42>": 173, "<PITCH_43>": 174, "<PITCH_44>": 175, "<PITCH_45>": 176, "<PITCH_46>": 177, "<PITCH_47>": 178, "<PITCH_48>": 179, "<PITCH_49>": 180, "<PITCH_50>": 181, "<PITCH_51>": 182, "<PITCH_52>": 183, "<PITCH_53>": 184, "<PITCH_54>": 185, "<PITCH_55>": 186, "<PITCH_56>": 187, "<PITCH_57>": 188, "<PITCH_58>": 189, "<PITCH_59>": 190, "<PITCH_60>": 191, "<PITCH_61>": 192, "<PITCH_62>": 193, "<PITCH_63>": 194, "<PITCH_64>": 195, "<PITCH_65>": 196, "<PITCH_66>": 197, "<PITCH_67>": 198, "<PITCH_68>": 199, "<PITCH_69>": 200, "<PITCH_70>": 201, "<PITCH_71>": 202, "<PITCH_72>": 203, "<PITCH_73>": 204, "<PITCH_74>": 205, "<PITCH_75>": 206, "<PITCH_76>": 207, "<PITCH_77>": 208, "<PITCH_78>": 209, "<PITCH_79>": 210, "<PITCH_80>": 211, "<PITCH_81>": 212, "<PITCH_82>": 213, "<PITCH_83>": 214, "<PITCH_84>": 215, "<PITCH_85>": 216, "<PITCH_86>": 217, "<PITCH_87>": 218, "<PITCH_88>": 219, "<PITCH_89>": 220, "<PITCH_90>": 221, "<PITCH_91>": 222, "<PITCH_92>": 223, "<PITCH_93>": 224, "<PITCH_94>": 225, "<PITCH_95>": 226, "<PITCH_96>": 227, "<PITCH_97>": 228, "<PITCH_98>": 229, "<PITCH_99>": 230, "<PITCH_100>": 231, "<PITCH_101>": 232, "<PITCH_102>": 233, "<PITCH_103>": 234, "<PITCH_104>": 235, "<PITCH_105>": 236, "<PITCH_106>": 237, "<PITCH_107>": 238, "<PITCH_108>": 239, "<REST>": 240, "<DUR_1>": 241, "<DUR_2>": 242, "<DUR_3>": 243, "<DUR_4>": 244, "<DUR_6>": 245, "<DUR_8>": 246, "<DUR_12>": 247, "<DUR_16>": 248, "<DUR_T2>": 249, "<DUR_T4>": 250, "<VEL_16>": 251, "<VEL_32>": 252, "<VEL_48>": 253, "<VEL_64>": 254, "<VEL_80>": 255, "<VEL_96>": 256, "<VEL_112>": 257, "<VEL_127>": 258, "<CHORD_C_MAJ>": 259, "<CHORD_C_MIN>": 260, "<CHORD_C_DIM>": 261, "<CHORD_C_AUG>": 262, "<CHORD_C_MAJ7>": 263, "<CHORD_C_MIN7>": 264, "<CHORD_C_DOM7>": 265, "<CHORD_C_DIM7>": 266, "<CHORD_Cs_MAJ>": 267, "<CHORD_Cs_MIN>": 268, "<CHORD_Cs_DIM>": 269, "<CHORD_Cs_AUG>": 270, "<CHORD_Cs_MAJ7>": 271, "<CHORD_Cs_MIN7>": 272, "<CHORD_Cs_DOM7>": 273, "<CHORD_Cs_DIM7>": 274, "<CHORD_D_MAJ>": 275, "<CHORD_D_MIN>": 276, "<CHORD_D_DIM>": 277, "<CHORD_D_AUG>": 278, "<CHORD_D_MAJ7>": 279, "<CHORD_D_MIN7>": 280, "<CHORD_D_DOM7>": 281, "<CHORD_D_DIM7>": 282, "<CHORD_Ds_MAJ>": 283, "<CHORD_Ds_MIN>": 284, "<CHORD_Ds_DIM>": 285, "<CHORD_Ds_AUG>": 286, "<CHORD_Ds_MAJ7>": 287, "<CHORD_Ds_MIN7>": 288, "<CHORD_Ds_DOM7>": 289, "<CHORD_Ds_DIM7>": 290, "<CHORD_E_MAJ>": 291, "<CHORD_E_MIN>": 292, "<CHORD_E_DIM>": 293, "<CHORD_E_AUG>": 294, "<CHORD_E_MAJ7>": 295, "<CHORD_E_MIN7>": 296, "<CHORD_E_DOM7>": 297, "<CHORD_E_DIM7>": 298, "<CHORD_F_MAJ>": 299, "<CHORD_F_MIN>": 300, "<CHORD_F_DIM>": 301, "<CHORD_F_AUG>": 302, "<CHORD_F_MAJ7>": 303, "<CHORD_F_MIN7>": 304, "<CHORD_F_DOM7>": 305, "<CHORD_F_DIM7>": 306, "<CHORD_Fs_MAJ>": 307, "<CHORD_Fs_MIN>": 308, "<CHORD_Fs_DIM>": 309, "<CHORD_Fs_AUG>": 310, "<CHORD_Fs_MAJ7>": 311, "<CHORD_Fs_MIN7>": 312, "<CHORD_Fs_DOM7>": 313, "<CHORD_Fs_DIM7>": 314, "<CHORD_G_MAJ>": 315, "<CHORD_G_MIN>": 316, "<CHORD_G_DIM>": 317, "<CHORD_G_AUG>": 318, "<CHORD_G_MAJ7>": 319, "<CHORD_G_MIN7>": 320, "<CHORD_G_DOM7>": 321, "<CHORD_G_DIM7>": 322, "<CHORD_Gs_MAJ>": 323, "<CHORD_Gs_MIN>": 324, "<CHORD_Gs_DIM>": 325, "<CHORD_Gs_AUG>": 326, "<CHORD_Gs_MAJ7>": 327, "<CHORD_Gs_MIN7>": 328, "<CHORD_Gs_DOM7>": 329, "<CHORD_Gs_DIM7>": 330, "<CHORD_A_MAJ>": 331, "<CHORD_A_MIN>": 332, "<CHORD_A_DIM>": 333, "<CHORD_A_AUG>": 334, "<CHORD_A_MAJ7>": 335, "<CHORD_A_MIN7>": 336, "<CHORD_A_DOM7>": 337, "<CHORD_A_DIM7>": 338, "<CHORD_As_MAJ>": 339, "<CHORD_As_MIN>": 340, "<CHORD_As_DIM>": 341, "<CHORD_As_AUG>": 342, "<CHORD_As_MAJ7>": 343, "<CHORD_As_MIN7>": 344, "<CHORD_As_DOM7>": 345, "<CHORD_As_DIM7>": 346, "<CHORD_B_MAJ>": 347, "<CHORD_B_MIN>": 348, "<CHORD_B_DIM>": 349, "<CHORD_B_AUG>": 350, "<CHORD_B_MAJ7>": 351, "<CHORD_B_MIN7>": 352, "<CHORD_B_DOM7>": 353, "<CHORD_B_DIM7>": 354}, "id2token": {"0": "<PAD>", "1": "<SOS>", "2": "<EOS>", "3": "<SEP>", "4": "<UNK>", "5": "<MASK>", "6": "<GENRE_ROCK>", "7": "<GENRE_POP>", "8": "<GENRE_FUNK>", "9": "<GENRE_JAZZ>", "10": "<GENRE_LATIN>", "11": "<GENRE_CLASSICAL>", "12": "<GENRE_ELECTRONIC>", "13": "<MOOD_HAPPY>", "14": "<MOOD_SAD>", "15": "<MOOD_DARK>", "16": "<MOOD_RELAXED>", "17": "<MOOD_TENSE>", "18": "<ENERGY_LOW>", "19": "<ENERGY_MED>", "20": "<ENERGY_HIGH>", "21": "<TIMESIG_3_4>", "22": "<TIMESIG_4_4>", "23": "<TIMESIG_6_8>", "24": "<KEY_C_MAJ>", "25": "<KEY_C_MIN>", "26": "<KEY_Cs_MAJ>", "27": "<KEY_Cs_MIN>", "28": "<KEY_D_MAJ>", "29": "<KEY_D_MIN>", "30": "<KEY_Ds_MAJ>", "31": "<KEY_Ds_MIN>", "32": "<KEY_E_MAJ>", "33": "<KEY_E_MIN>", "34": "<KEY_F_MAJ>", "35": "<KEY_F_MIN>", "36": "<KEY_Fs_MAJ>", "37": "<KEY_Fs_MIN>", "38": "<KEY_G_MAJ>", "39": "<KEY_G_MIN>", "40": "<KEY_Gs_MAJ>", "41": "<KEY_Gs_MIN>", "42": "<KEY_A_MAJ>", "43": "<KEY_A_MIN>", "44": "<KEY_As_MAJ>", "45": "<KEY_As_MIN>", "46": "<KEY_B_MAJ>", "47": "<KEY_B_MIN>", "48": "<TEMPO_60>", "49": "<TEMPO_80>", "50": "<TEMPO_100>", "51": "<TEMPO_120>", "52": "<TEMPO_140>", "53": "<TEMPO_160>", "54": "<TEMPO_180>", "55": "<TEMPO_200>", "56": "<BAR_1>", "57": "<BAR_2>", "58": "<BAR_3>", "59": "<BAR_4>", "60": "<BAR_5>", "61": "<BAR_6>", "62": "<BAR_7>", "63": "<BAR_8>", "64": "<BAR_9>", "65": "<BAR_10>", "66": "<BAR_11>", "67": "<BAR_12>", "68": "<BAR_13>", "69": "<BAR_14>", "70": "<BAR_15>", "71": "<BAR_16>", "72": "<BAR_17>", "73": "<BAR_18>", "74": "<BAR_19>", "75": "<BAR_20>", "76": "<BAR_21>", "77": "<BAR_22>", "78": "<BAR_23>", "79": "<BAR_24>", "80": "<BAR_25>", "81": "<BAR_26>", "82": "<BAR_27>", "83": "<BAR_28>", "84": "<BAR_29>", "85": "<BAR_30>", "86": "<BAR_31>", "87": "<BAR_32>", "88": "<BEAT_1>", "89": "<BEAT_2>", "90": "<BEAT_3>", "91": "<BEAT_4>", "92": "<POS_0>", "93": "<POS_1>", "94": "<POS_2>", "95": "<POS_3>", "96": "<POS_4>", "97": "<POS_5>", "98": "<POS_6>", "99": "<POS_7>", "100": "<POS_8>", "101": "<POS_9>", "102": "<POS_10>", "103": "<POS_11>", "104": "<POS_12>", "105": "<POS_13>", "106": "<POS_14>", "107": "<POS_15>", "108": "<POS_16>", "109": "<POS_17>", "110": "<POS_18>", "111": "<POS_19>", "112": "<POS_20>", "113": "<POS_21>", "114": "<POS_22>", "115": "<POS_23>", "116": "<POS_24>", "117": "<POS_25>", "118": "<POS_26>", "119": "<POS_27>", "120": "<POS_28>", "121": "<POS_29>", "122": "<POS_30>", "123": "<POS_31>", "124": "<POS_32>", "125": "<POS_33>", "126": "<POS_34>", "127": "<POS_35>", "128": "<POS_36>", "129": "<POS_37>", "130": "<POS_38>", "131": "<POS_39>", "132": "<POS_40>", "133": "<POS_41>", "134": "<POS_42>", "135": "<POS_43>", "136": "<POS_44>", "137": "<POS_45>", "138": "<POS_46>", "139": "<POS_47>", "140": "<POS_48>", "141": "<POS_49>", "142": "<POS_50>", "143": "<POS_51>", "144": "<POS_52>", "145": "<POS_53>", "146": "<POS_54>", "147": "<POS_55>", "148": "<POS_56>", "149": "<POS_57>", "150": "<POS_58>", "151": "<POS_59>", "152": "<POS_60>", "153": "<POS_61>", "154": "<POS_62>", "155": "<POS_63>", "156": "<INST_PIANO>", "157": "<INST_BASS>", "158": "<INST_GUITAR>", "159": "<PITCH_28>", "160": "<PITCH_29>", "161": "<PITCH_30>", "162": "<PITCH_31>", "163": "<PITCH_32>", "164": "<PITCH_33>", "165": "<PITCH_34>", "166": "<PITCH_35>", "167": "<PITCH_36>", "168": "<PITCH_37>", "169": "<PITCH_38>", "170": "<PITCH_39>", "171": "<PITCH_40>", "172": "<PITCH_41>", "173": "<PITCH_42>", "174": "<PITCH_43>", "175": "<PITCH_44>", "176": "<PITCH_45>", "177": "<PITCH_46>", "178": "<PITCH_47>", "179": "<PITCH_48>", "180": "<PITCH_49>", "181": "<PITCH_50>", "182": "<PITCH_51>", "183": "<PITCH_52>", "184": "<PITCH_53>", "185": "<PITCH_54>", "186": "<PITCH_55>", "187": "<PITCH_56>", "188": "<PITCH_57>", "189": "<PITCH_58>", "190": "<PITCH_59>", "191": "<PITCH_60>", "192": "<PITCH_61>", "193": "<PITCH_62>", "194": "<PITCH_63>", "195": "<PITCH_64>", "196": "<PITCH_65>", "197": "<PITCH_66>", "198": "<PITCH_67>", "199": "<PITCH_68>", "200": "<PITCH_69>", "201": "<PITCH_70>", "202": "<PITCH_71>", "203": "<PITCH_72>", "204": "<PITCH_73>", "205": "<PITCH_74>", "206": "<PITCH_75>", "207": "<PITCH_76>", "208": "<PITCH_77>", "209": "<PITCH_78>", "210": "<PITCH_79>", "211": "<PITCH_80>", "212": "<PITCH_81>", "213": "<PITCH_82>", "214": "<PITCH_83>", "215": "<PITCH_84>", "216": "<PITCH_85>", "217": "<PITCH_86>", "218": "<PITCH_87>", "219": "<PITCH_88>", "220": "<PITCH_89>", "221": "<PITCH_90>", "222": "<PITCH_91>", "223": "<PITCH_92>", "224": "<PITCH_93>", "225": "<PITCH_94>", "226": "<PITCH_95>", "227": "<PITCH_96>", "228": "<PITCH_97>", "229": "<PITCH_98>", "230": "<PITCH_99>", "231": "<PITCH_100>", "232": "<PITCH_101>", "233": "<PITCH_102>", "234": "<PITCH_103>", "235": "<PITCH_104>", "236": "<PITCH_105>", "237": "<PITCH_106>", "238": "<PITCH_107>", "239": "<PITCH_108>", "240": "<REST>", "241": "<DUR_1>", "242": "<DUR_2>", "243": "<DUR_3>", "244": "<DUR_4>", "245": "<DUR_6>", "246": "<DUR_8>", "247": "<DUR_12>", "248": "<DUR_16>", "249": "<DUR_T2>", "250": "<DUR_T4>", "251": "<VEL_16>", "252": "<VEL_32>", "253": "<VEL_48>", "254": "<VEL_64>", "255": "<VEL_80>", "256": "<VEL_96>", "257": "<VEL_112>", "258": "<VEL_127>", "259": "<CHORD_C_MAJ>", "260": "<CHORD_C_MIN>", "261": "<CHORD_C_DIM>", "262": "<CHORD_C_AUG>", "263": "<CHORD_C_MAJ7>", "264": "<CHORD_C_MIN7>", "265": "<CHORD_C_DOM7>", "266": "<CHORD_C_DIM7>", "267": "<CHORD_Cs_MAJ>", "268": "<CHORD_Cs_MIN>", "269": "<CHORD_Cs_DIM>", "270": "<CHORD_Cs_AUG>", "271": "<CHORD_Cs_MAJ7>", "272": "<CHORD_Cs_MIN7>", "273": "<CHORD_Cs_DOM7>", "274": "<CHORD_Cs_DIM7>", "275": "<CHORD_D_MAJ>", "276": "<CHORD_D_MIN>", "277": "<CHORD_D_DIM>", "278": "<CHORD_D_AUG>", "279": "<CHORD_D_MAJ7>", "280": "<CHORD_D_MIN7>", "281": "<CHORD_D_DOM7>", "282": "<CHORD_D_DIM7>", "283": "<CHORD_Ds_MAJ>", "284": "<CHORD_Ds_MIN>", "285": "<CHORD_Ds_DIM>", "286": "<CHORD_Ds_AUG>", "287": "<CHORD_Ds_MAJ7>", "288": "<CHORD_Ds_MIN7>", "289": "<CHORD_Ds_DOM7>", "290": "<CHORD_Ds_DIM7>", "291": "<CHORD_E_MAJ>", "292": "<CHORD_E_MIN>", "293": "<CHORD_E_DIM>", "294": "<CHORD_E_AUG>", "295": "<CHORD_E_MAJ7>", "296": "<CHORD_E_MIN7>", "297": "<CHORD_E_DOM7>", "298": "<CHORD_E_DIM7>", "299": "<CHORD_F_MAJ>", "300": "<CHORD_F_MIN>", "301": "<CHORD_F_DIM>", "302": "<CHORD_F_AUG>", "303": "<CHORD_F_MAJ7>", "304": "<CHORD_F_MIN7>", "305": "<CHORD_F_DOM7>", "306": "<CHORD_F_DIM7>", "307": "<CHORD_Fs_MAJ>", "308": "<CHORD_Fs_MIN>", "309": "<CHORD_Fs_DIM>", "310": "<CHORD_Fs_AUG>", "311": "<CHORD_Fs_MAJ7>", "312": "<CHORD_Fs_MIN7>", "313": "<CHORD_Fs_DOM7>", "314": "<CHORD_Fs_DIM7>", "315": "<CHORD_G_MAJ>", "316": "<CHORD_G_MIN>", "317": "<CHORD_G_DIM>", "318": "<CHORD_G_AUG>", "319": "<CHORD_G_MAJ7>", "320": "<CHORD_G_MIN7>", "321": "<CHORD_G_DOM7>", "322": "<CHORD_G_DIM7>", "323": "<CHORD_Gs_MAJ>", "324": "<CHORD_Gs_MIN>", "325": "<CHORD_Gs_DIM>", "326": "<CHORD_Gs_AUG>", "327": "<CHORD_Gs_MAJ7>", "328": "<CHORD_Gs_MIN7>", "329": "<CHORD_Gs_DOM7>", "330": "<CHORD_Gs_DIM7>", "331": "<CHORD_A_MAJ>", "332": "<CHORD_A_MIN>", "333": "<CHORD_A_DIM>", "334": "<CHORD_A_AUG>", "335": "<CHORD_A_MAJ7>", "336": "<CHORD_A_MIN7>", "337": "<CHORD_A_DOM7>", "338": "<CHORD_A_DIM7>", "339": "<CHORD_As_MAJ>", "340": "<CHORD_As_MIN>", "341": "<CHORD_As_DIM>", "342": "<CHORD_As_AUG>", "343": "<CHORD_As_MAJ7>", "344": "<CHORD_As_MIN7>", "345": "<CHORD_As_DOM7>", "346": "<CHORD_As_DIM7>", "347": "<CHORD_B_MAJ>", "348": "<CHORD_B_MIN>", "349": "<CHORD_B_DIM>", "350": "<CHORD_B_AUG>", "351": "<CHORD_B_MAJ7>", "352": "<CHORD_B_MIN7>", "353": "<CHORD_B_DOM7>", "354": "<CHORD_B_DIM7>"}}