{"token2id": {"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "<SEP>": 3, "<UNK>": 4, "<MASK>": 5, "<GENRE_ROCK>": 6, "<GENRE_POP>": 7, "<GENRE_FUNK>": 8, "<GENRE_JAZZ>": 9, "<GENRE_LATIN>": 10, "<GENRE_CLASSICAL>": 11, "<GENRE_ELECTRONIC>": 12, "<MOOD_HAPPY>": 13, "<MOOD_SAD>": 14, "<MOOD_DARK>": 15, "<MOOD_RELAXED>": 16, "<MOOD_TENSE>": 17, "<ENERGY_LOW>": 18, "<ENERGY_MED>": 19, "<ENERGY_HIGH>": 20, "<TIMESIG_3_4>": 21, "<TIMESIG_4_4>": 22, "<TIMESIG_6_8>": 23, "<KEY_C_MAJ>": 24, "<KEY_C_MIN>": 25, "<KEY_Cs_MAJ>": 26, "<KEY_Cs_MIN>": 27, "<KEY_D_MAJ>": 28, "<KEY_D_MIN>": 29, "<KEY_Ds_MAJ>": 30, "<KEY_Ds_MIN>": 31, "<KEY_E_MAJ>": 32, "<KEY_E_MIN>": 33, "<KEY_F_MAJ>": 34, "<KEY_F_MIN>": 35, "<KEY_Fs_MAJ>": 36, "<KEY_Fs_MIN>": 37, "<KEY_G_MAJ>": 38, "<KEY_G_MIN>": 39, "<KEY_Gs_MAJ>": 40, "<KEY_Gs_MIN>": 41, "<KEY_A_MAJ>": 42, "<KEY_A_MIN>": 43, "<KEY_As_MAJ>": 44, "<KEY_As_MIN>": 45, "<KEY_B_MAJ>": 46, "<KEY_B_MIN>": 47, "<TEMPO_60>": 48, "<TEMPO_80>": 49, "<TEMPO_100>": 50, "<TEMPO_120>": 51, "<TEMPO_140>": 52, "<TEMPO_160>": 53, "<TEMPO_180>": 54, "<TEMPO_200>": 55, "<INST_PIANO>": 56, "<INST_BASS>": 57, "<INST_GUITAR>": 58, "<CHORD_C_MAJ>": 59, "<CHORD_C_MIN>": 60, "<CHORD_C_DIM>": 61, "<CHORD_C_AUG>": 62, "<CHORD_C_MAJ7>": 63, "<CHORD_C_MIN7>": 64, "<CHORD_C_DOM7>": 65, "<CHORD_C_DIM7>": 66, "<CHORD_Cs_MAJ>": 67, "<CHORD_Cs_MIN>": 68, "<CHORD_Cs_DIM>": 69, "<CHORD_Cs_AUG>": 70, "<CHORD_Cs_MAJ7>": 71, "<CHORD_Cs_MIN7>": 72, "<CHORD_Cs_DOM7>": 73, "<CHORD_Cs_DIM7>": 74, "<CHORD_D_MAJ>": 75, "<CHORD_D_MIN>": 76, "<CHORD_D_DIM>": 77, "<CHORD_D_AUG>": 78, "<CHORD_D_MAJ7>": 79, "<CHORD_D_MIN7>": 80, "<CHORD_D_DOM7>": 81, "<CHORD_D_DIM7>": 82, "<CHORD_Ds_MAJ>": 83, "<CHORD_Ds_MIN>": 84, "<CHORD_Ds_DIM>": 85, "<CHORD_Ds_AUG>": 86, "<CHORD_Ds_MAJ7>": 87, "<CHORD_Ds_MIN7>": 88, "<CHORD_Ds_DOM7>": 89, "<CHORD_Ds_DIM7>": 90, "<CHORD_E_MAJ>": 91, "<CHORD_E_MIN>": 92, "<CHORD_E_DIM>": 93, "<CHORD_E_AUG>": 94, "<CHORD_E_MAJ7>": 95, "<CHORD_E_MIN7>": 96, "<CHORD_E_DOM7>": 97, "<CHORD_E_DIM7>": 98, "<CHORD_F_MAJ>": 99, "<CHORD_F_MIN>": 100, "<CHORD_F_DIM>": 101, "<CHORD_F_AUG>": 102, "<CHORD_F_MAJ7>": 103, "<CHORD_F_MIN7>": 104, "<CHORD_F_DOM7>": 105, "<CHORD_F_DIM7>": 106, "<CHORD_Fs_MAJ>": 107, "<CHORD_Fs_MIN>": 108, "<CHORD_Fs_DIM>": 109, "<CHORD_Fs_AUG>": 110, "<CHORD_Fs_MAJ7>": 111, "<CHORD_Fs_MIN7>": 112, "<CHORD_Fs_DOM7>": 113, "<CHORD_Fs_DIM7>": 114, "<CHORD_G_MAJ>": 115, "<CHORD_G_MIN>": 116, "<CHORD_G_DIM>": 117, "<CHORD_G_AUG>": 118, "<CHORD_G_MAJ7>": 119, "<CHORD_G_MIN7>": 120, "<CHORD_G_DOM7>": 121, "<CHORD_G_DIM7>": 122, "<CHORD_Gs_MAJ>": 123, "<CHORD_Gs_MIN>": 124, "<CHORD_Gs_DIM>": 125, "<CHORD_Gs_AUG>": 126, "<CHORD_Gs_MAJ7>": 127, "<CHORD_Gs_MIN7>": 128, "<CHORD_Gs_DOM7>": 129, "<CHORD_Gs_DIM7>": 130, "<CHORD_A_MAJ>": 131, "<CHORD_A_MIN>": 132, "<CHORD_A_DIM>": 133, "<CHORD_A_AUG>": 134, "<CHORD_A_MAJ7>": 135, "<CHORD_A_MIN7>": 136, "<CHORD_A_DOM7>": 137, "<CHORD_A_DIM7>": 138, "<CHORD_As_MAJ>": 139, "<CHORD_As_MIN>": 140, "<CHORD_As_DIM>": 141, "<CHORD_As_AUG>": 142, "<CHORD_As_MAJ7>": 143, "<CHORD_As_MIN7>": 144, "<CHORD_As_DOM7>": 145, "<CHORD_As_DIM7>": 146, "<CHORD_B_MAJ>": 147, "<CHORD_B_MIN>": 148, "<CHORD_B_DIM>": 149, "<CHORD_B_AUG>": 150, "<CHORD_B_MAJ7>": 151, "<CHORD_B_MIN7>": 152, "<CHORD_B_DOM7>": 153, "<CHORD_B_DIM7>": 154, "<BAR_1>": 155, "<BAR_2>": 156, "<BAR_3>": 157, "<BAR_4>": 158, "<BAR_5>": 159, "<BAR_6>": 160, "<BAR_7>": 161, "<BAR_8>": 162, "<BAR_9>": 163, "<BAR_10>": 164, "<BAR_11>": 165, "<BAR_12>": 166, "<BAR_13>": 167, "<BAR_14>": 168, "<BAR_15>": 169, "<BAR_16>": 170, "<BAR_17>": 171, "<BAR_18>": 172, "<BAR_19>": 173, "<BAR_20>": 174, "<BAR_21>": 175, "<BAR_22>": 176, "<BAR_23>": 177, "<BAR_24>": 178, "<BAR_25>": 179, "<BAR_26>": 180, "<BAR_27>": 181, "<BAR_28>": 182, "<BAR_29>": 183, "<BAR_30>": 184, "<BAR_31>": 185, "<BAR_32>": 186, "<BEAT_1>": 187, "<BEAT_2>": 188, "<BEAT_3>": 189, "<BEAT_4>": 190, "<POS_0>": 191, "<POS_1>": 192, "<POS_2>": 193, "<POS_3>": 194, "<POS_4>": 195, "<POS_5>": 196, "<POS_6>": 197, "<POS_7>": 198, "<POS_8>": 199, "<POS_9>": 200, "<POS_10>": 201, "<POS_11>": 202, "<POS_12>": 203, "<POS_13>": 204, "<POS_14>": 205, "<POS_15>": 206, "<POS_16>": 207, "<POS_17>": 208, "<POS_18>": 209, "<POS_19>": 210, "<POS_20>": 211, "<POS_21>": 212, "<POS_22>": 213, "<POS_23>": 214, "<POS_24>": 215, "<POS_25>": 216, "<POS_26>": 217, "<POS_27>": 218, "<POS_28>": 219, "<POS_29>": 220, "<POS_30>": 221, "<POS_31>": 222, "<PITCH_28>": 223, "<PITCH_29>": 224, "<PITCH_30>": 225, "<PITCH_31>": 226, "<PITCH_32>": 227, "<PITCH_33>": 228, "<PITCH_34>": 229, "<PITCH_35>": 230, "<PITCH_36>": 231, "<PITCH_37>": 232, "<PITCH_38>": 233, "<PITCH_39>": 234, "<PITCH_40>": 235, "<PITCH_41>": 236, "<PITCH_42>": 237, "<PITCH_43>": 238, "<PITCH_44>": 239, "<PITCH_45>": 240, "<PITCH_46>": 241, "<PITCH_47>": 242, "<PITCH_48>": 243, "<PITCH_49>": 244, "<PITCH_50>": 245, "<PITCH_51>": 246, "<PITCH_52>": 247, "<PITCH_53>": 248, "<PITCH_54>": 249, "<PITCH_55>": 250, "<PITCH_56>": 251, "<PITCH_57>": 252, "<PITCH_58>": 253, "<PITCH_59>": 254, "<PITCH_60>": 255, "<PITCH_61>": 256, "<PITCH_62>": 257, "<PITCH_63>": 258, "<PITCH_64>": 259, "<PITCH_65>": 260, "<PITCH_66>": 261, "<PITCH_67>": 262, "<PITCH_68>": 263, "<PITCH_69>": 264, "<PITCH_70>": 265, "<PITCH_71>": 266, "<PITCH_72>": 267, "<PITCH_73>": 268, "<PITCH_74>": 269, "<PITCH_75>": 270, "<PITCH_76>": 271, "<PITCH_77>": 272, "<PITCH_78>": 273, "<PITCH_79>": 274, "<PITCH_80>": 275, "<PITCH_81>": 276, "<PITCH_82>": 277, "<PITCH_83>": 278, "<PITCH_84>": 279, "<PITCH_85>": 280, "<PITCH_86>": 281, "<PITCH_87>": 282, "<PITCH_88>": 283, "<PITCH_89>": 284, "<PITCH_90>": 285, "<PITCH_91>": 286, "<PITCH_92>": 287, "<PITCH_93>": 288, "<PITCH_94>": 289, "<PITCH_95>": 290, "<PITCH_96>": 291, "<PITCH_97>": 292, "<PITCH_98>": 293, "<PITCH_99>": 294, "<PITCH_100>": 295, "<PITCH_101>": 296, "<PITCH_102>": 297, "<PITCH_103>": 298, "<PITCH_104>": 299, "<PITCH_105>": 300, "<PITCH_106>": 301, "<PITCH_107>": 302, "<PITCH_108>": 303, "<REST>": 304, "<DUR_1>": 305, "<DUR_2>": 306, "<DUR_3>": 307, "<DUR_4>": 308, "<DUR_6>": 309, "<DUR_8>": 310, "<DUR_12>": 311, "<DUR_16>": 312, "<DUR_T2>": 313, "<DUR_T4>": 314, "<VEL_16>": 315, "<VEL_32>": 316, "<VEL_48>": 317, "<VEL_64>": 318, "<VEL_80>": 319, "<VEL_96>": 320, "<VEL_112>": 321, "<VEL_127>": 322, "<NOTE_ON_28>": 323, "<NOTE_ON_29>": 324, "<NOTE_ON_30>": 325, "<NOTE_ON_31>": 326, "<NOTE_ON_32>": 327, "<NOTE_ON_33>": 328, "<NOTE_ON_34>": 329, "<NOTE_ON_35>": 330, "<NOTE_ON_36>": 331, "<NOTE_ON_37>": 332, "<NOTE_ON_38>": 333, "<NOTE_ON_39>": 334, "<NOTE_ON_40>": 335, "<NOTE_ON_41>": 336, "<NOTE_ON_42>": 337, "<NOTE_ON_43>": 338, "<NOTE_ON_44>": 339, "<NOTE_ON_45>": 340, "<NOTE_ON_46>": 341, "<NOTE_ON_47>": 342, "<NOTE_ON_48>": 343, "<NOTE_ON_49>": 344, "<NOTE_ON_50>": 345, "<NOTE_ON_51>": 346, "<NOTE_ON_52>": 347, "<NOTE_ON_53>": 348, "<NOTE_ON_54>": 349, "<NOTE_ON_55>": 350, "<NOTE_ON_56>": 351, "<NOTE_ON_57>": 352, "<NOTE_ON_58>": 353, "<NOTE_ON_59>": 354, "<NOTE_ON_60>": 355, "<NOTE_ON_61>": 356, "<NOTE_ON_62>": 357, "<NOTE_ON_63>": 358, "<NOTE_ON_64>": 359, "<NOTE_ON_65>": 360, "<NOTE_ON_66>": 361, "<NOTE_ON_67>": 362, "<NOTE_ON_68>": 363, "<NOTE_ON_69>": 364, "<NOTE_ON_70>": 365, "<NOTE_ON_71>": 366, "<NOTE_ON_72>": 367, "<NOTE_ON_73>": 368, "<NOTE_ON_74>": 369, "<NOTE_ON_75>": 370, "<NOTE_ON_76>": 371, "<NOTE_ON_77>": 372, "<NOTE_ON_78>": 373, "<NOTE_ON_79>": 374, "<NOTE_ON_80>": 375, "<NOTE_ON_81>": 376, "<NOTE_ON_82>": 377, "<NOTE_ON_83>": 378, "<NOTE_ON_84>": 379, "<NOTE_ON_85>": 380, "<NOTE_ON_86>": 381, "<NOTE_ON_87>": 382, "<NOTE_ON_88>": 383, "<NOTE_ON_89>": 384, "<NOTE_ON_90>": 385, "<NOTE_ON_91>": 386, "<NOTE_ON_92>": 387, "<NOTE_ON_93>": 388, "<NOTE_ON_94>": 389, "<NOTE_ON_95>": 390, "<NOTE_ON_96>": 391, "<NOTE_ON_97>": 392, "<NOTE_ON_98>": 393, "<NOTE_ON_99>": 394, "<NOTE_ON_100>": 395, "<NOTE_ON_101>": 396, "<NOTE_ON_102>": 397, "<NOTE_ON_103>": 398, "<NOTE_ON_104>": 399, "<NOTE_ON_105>": 400, "<NOTE_ON_106>": 401, "<NOTE_ON_107>": 402, "<NOTE_ON_108>": 403, "<NOTE_OFF_28>": 404, "<NOTE_OFF_29>": 405, "<NOTE_OFF_30>": 406, "<NOTE_OFF_31>": 407, "<NOTE_OFF_32>": 408, "<NOTE_OFF_33>": 409, "<NOTE_OFF_34>": 410, "<NOTE_OFF_35>": 411, "<NOTE_OFF_36>": 412, "<NOTE_OFF_37>": 413, "<NOTE_OFF_38>": 414, "<NOTE_OFF_39>": 415, "<NOTE_OFF_40>": 416, "<NOTE_OFF_41>": 417, "<NOTE_OFF_42>": 418, "<NOTE_OFF_43>": 419, "<NOTE_OFF_44>": 420, "<NOTE_OFF_45>": 421, "<NOTE_OFF_46>": 422, "<NOTE_OFF_47>": 423, "<NOTE_OFF_48>": 424, "<NOTE_OFF_49>": 425, "<NOTE_OFF_50>": 426, "<NOTE_OFF_51>": 427, "<NOTE_OFF_52>": 428, "<NOTE_OFF_53>": 429, "<NOTE_OFF_54>": 430, "<NOTE_OFF_55>": 431, "<NOTE_OFF_56>": 432, "<NOTE_OFF_57>": 433, "<NOTE_OFF_58>": 434, "<NOTE_OFF_59>": 435, "<NOTE_OFF_60>": 436, "<NOTE_OFF_61>": 437, "<NOTE_OFF_62>": 438, "<NOTE_OFF_63>": 439, "<NOTE_OFF_64>": 440, "<NOTE_OFF_65>": 441, "<NOTE_OFF_66>": 442, "<NOTE_OFF_67>": 443, "<NOTE_OFF_68>": 444, "<NOTE_OFF_69>": 445, "<NOTE_OFF_70>": 446, "<NOTE_OFF_71>": 447, "<NOTE_OFF_72>": 448, "<NOTE_OFF_73>": 449, "<NOTE_OFF_74>": 450, "<NOTE_OFF_75>": 451, "<NOTE_OFF_76>": 452, "<NOTE_OFF_77>": 453, "<NOTE_OFF_78>": 454, "<NOTE_OFF_79>": 455, "<NOTE_OFF_80>": 456, "<NOTE_OFF_81>": 457, "<NOTE_OFF_82>": 458, "<NOTE_OFF_83>": 459, "<NOTE_OFF_84>": 460, "<NOTE_OFF_85>": 461, "<NOTE_OFF_86>": 462, "<NOTE_OFF_87>": 463, "<NOTE_OFF_88>": 464, "<NOTE_OFF_89>": 465, "<NOTE_OFF_90>": 466, "<NOTE_OFF_91>": 467, "<NOTE_OFF_92>": 468, "<NOTE_OFF_93>": 469, "<NOTE_OFF_94>": 470, "<NOTE_OFF_95>": 471, "<NOTE_OFF_96>": 472, "<NOTE_OFF_97>": 473, "<NOTE_OFF_98>": 474, "<NOTE_OFF_99>": 475, "<NOTE_OFF_100>": 476, "<NOTE_OFF_101>": 477, "<NOTE_OFF_102>": 478, "<NOTE_OFF_103>": 479, "<NOTE_OFF_104>": 480, "<NOTE_OFF_105>": 481, "<NOTE_OFF_106>": 482, "<NOTE_OFF_107>": 483, "<NOTE_OFF_108>": 484, "<TIME_SHIFT_1>": 485, "<TIME_SHIFT_2>": 486, "<TIME_SHIFT_3>": 487, "<TIME_SHIFT_4>": 488, "<TIME_SHIFT_5>": 489, "<TIME_SHIFT_6>": 490, "<TIME_SHIFT_7>": 491, "<TIME_SHIFT_8>": 492, "<TIME_SHIFT_9>": 493, "<TIME_SHIFT_10>": 494, "<TIME_SHIFT_11>": 495, "<TIME_SHIFT_12>": 496, "<TIME_SHIFT_13>": 497, "<TIME_SHIFT_14>": 498, "<TIME_SHIFT_15>": 499, "<TIME_SHIFT_16>": 500, "<TIME_SHIFT_17>": 501, "<TIME_SHIFT_18>": 502, "<TIME_SHIFT_19>": 503, "<TIME_SHIFT_20>": 504, "<TIME_SHIFT_21>": 505, "<TIME_SHIFT_22>": 506, "<TIME_SHIFT_23>": 507, "<TIME_SHIFT_24>": 508, "<TIME_SHIFT_25>": 509, "<TIME_SHIFT_26>": 510, "<TIME_SHIFT_27>": 511, "<TIME_SHIFT_28>": 512, "<TIME_SHIFT_29>": 513, "<TIME_SHIFT_30>": 514, "<TIME_SHIFT_31>": 515, "<TIME_SHIFT_32>": 516, "<VELOCITY_16>": 517, "<VELOCITY_32>": 518, "<VELOCITY_48>": 519, "<VELOCITY_64>": 520, "<VELOCITY_80>": 521, "<VELOCITY_96>": 522, "<VELOCITY_112>": 523, "<VELOCITY_127>": 524}, "id2token": {"0": "<PAD>", "1": "<SOS>", "2": "<EOS>", "3": "<SEP>", "4": "<UNK>", "5": "<MASK>", "6": "<GENRE_ROCK>", "7": "<GENRE_POP>", "8": "<GENRE_FUNK>", "9": "<GENRE_JAZZ>", "10": "<GENRE_LATIN>", "11": "<GENRE_CLASSICAL>", "12": "<GENRE_ELECTRONIC>", "13": "<MOOD_HAPPY>", "14": "<MOOD_SAD>", "15": "<MOOD_DARK>", "16": "<MOOD_RELAXED>", "17": "<MOOD_TENSE>", "18": "<ENERGY_LOW>", "19": "<ENERGY_MED>", "20": "<ENERGY_HIGH>", "21": "<TIMESIG_3_4>", "22": "<TIMESIG_4_4>", "23": "<TIMESIG_6_8>", "24": "<KEY_C_MAJ>", "25": "<KEY_C_MIN>", "26": "<KEY_Cs_MAJ>", "27": "<KEY_Cs_MIN>", "28": "<KEY_D_MAJ>", "29": "<KEY_D_MIN>", "30": "<KEY_Ds_MAJ>", "31": "<KEY_Ds_MIN>", "32": "<KEY_E_MAJ>", "33": "<KEY_E_MIN>", "34": "<KEY_F_MAJ>", "35": "<KEY_F_MIN>", "36": "<KEY_Fs_MAJ>", "37": "<KEY_Fs_MIN>", "38": "<KEY_G_MAJ>", "39": "<KEY_G_MIN>", "40": "<KEY_Gs_MAJ>", "41": "<KEY_Gs_MIN>", "42": "<KEY_A_MAJ>", "43": "<KEY_A_MIN>", "44": "<KEY_As_MAJ>", "45": "<KEY_As_MIN>", "46": "<KEY_B_MAJ>", "47": "<KEY_B_MIN>", "48": "<TEMPO_60>", "49": "<TEMPO_80>", "50": "<TEMPO_100>", "51": "<TEMPO_120>", "52": "<TEMPO_140>", "53": "<TEMPO_160>", "54": "<TEMPO_180>", "55": "<TEMPO_200>", "56": "<INST_PIANO>", "57": "<INST_BASS>", "58": "<INST_GUITAR>", "59": "<CHORD_C_MAJ>", "60": "<CHORD_C_MIN>", "61": "<CHORD_C_DIM>", "62": "<CHORD_C_AUG>", "63": "<CHORD_C_MAJ7>", "64": "<CHORD_C_MIN7>", "65": "<CHORD_C_DOM7>", "66": "<CHORD_C_DIM7>", "67": "<CHORD_Cs_MAJ>", "68": "<CHORD_Cs_MIN>", "69": "<CHORD_Cs_DIM>", "70": "<CHORD_Cs_AUG>", "71": "<CHORD_Cs_MAJ7>", "72": "<CHORD_Cs_MIN7>", "73": "<CHORD_Cs_DOM7>", "74": "<CHORD_Cs_DIM7>", "75": "<CHORD_D_MAJ>", "76": "<CHORD_D_MIN>", "77": "<CHORD_D_DIM>", "78": "<CHORD_D_AUG>", "79": "<CHORD_D_MAJ7>", "80": "<CHORD_D_MIN7>", "81": "<CHORD_D_DOM7>", "82": "<CHORD_D_DIM7>", "83": "<CHORD_Ds_MAJ>", "84": "<CHORD_Ds_MIN>", "85": "<CHORD_Ds_DIM>", "86": "<CHORD_Ds_AUG>", "87": "<CHORD_Ds_MAJ7>", "88": "<CHORD_Ds_MIN7>", "89": "<CHORD_Ds_DOM7>", "90": "<CHORD_Ds_DIM7>", "91": "<CHORD_E_MAJ>", "92": "<CHORD_E_MIN>", "93": "<CHORD_E_DIM>", "94": "<CHORD_E_AUG>", "95": "<CHORD_E_MAJ7>", "96": "<CHORD_E_MIN7>", "97": "<CHORD_E_DOM7>", "98": "<CHORD_E_DIM7>", "99": "<CHORD_F_MAJ>", "100": "<CHORD_F_MIN>", "101": "<CHORD_F_DIM>", "102": "<CHORD_F_AUG>", "103": "<CHORD_F_MAJ7>", "104": "<CHORD_F_MIN7>", "105": "<CHORD_F_DOM7>", "106": "<CHORD_F_DIM7>", "107": "<CHORD_Fs_MAJ>", "108": "<CHORD_Fs_MIN>", "109": "<CHORD_Fs_DIM>", "110": "<CHORD_Fs_AUG>", "111": "<CHORD_Fs_MAJ7>", "112": "<CHORD_Fs_MIN7>", "113": "<CHORD_Fs_DOM7>", "114": "<CHORD_Fs_DIM7>", "115": "<CHORD_G_MAJ>", "116": "<CHORD_G_MIN>", "117": "<CHORD_G_DIM>", "118": "<CHORD_G_AUG>", "119": "<CHORD_G_MAJ7>", "120": "<CHORD_G_MIN7>", "121": "<CHORD_G_DOM7>", "122": "<CHORD_G_DIM7>", "123": "<CHORD_Gs_MAJ>", "124": "<CHORD_Gs_MIN>", "125": "<CHORD_Gs_DIM>", "126": "<CHORD_Gs_AUG>", "127": "<CHORD_Gs_MAJ7>", "128": "<CHORD_Gs_MIN7>", "129": "<CHORD_Gs_DOM7>", "130": "<CHORD_Gs_DIM7>", "131": "<CHORD_A_MAJ>", "132": "<CHORD_A_MIN>", "133": "<CHORD_A_DIM>", "134": "<CHORD_A_AUG>", "135": "<CHORD_A_MAJ7>", "136": "<CHORD_A_MIN7>", "137": "<CHORD_A_DOM7>", "138": "<CHORD_A_DIM7>", "139": "<CHORD_As_MAJ>", "140": "<CHORD_As_MIN>", "141": "<CHORD_As_DIM>", "142": "<CHORD_As_AUG>", "143": "<CHORD_As_MAJ7>", "144": "<CHORD_As_MIN7>", "145": "<CHORD_As_DOM7>", "146": "<CHORD_As_DIM7>", "147": "<CHORD_B_MAJ>", "148": "<CHORD_B_MIN>", "149": "<CHORD_B_DIM>", "150": "<CHORD_B_AUG>", "151": "<CHORD_B_MAJ7>", "152": "<CHORD_B_MIN7>", "153": "<CHORD_B_DOM7>", "154": "<CHORD_B_DIM7>", "155": "<BAR_1>", "156": "<BAR_2>", "157": "<BAR_3>", "158": "<BAR_4>", "159": "<BAR_5>", "160": "<BAR_6>", "161": "<BAR_7>", "162": "<BAR_8>", "163": "<BAR_9>", "164": "<BAR_10>", "165": "<BAR_11>", "166": "<BAR_12>", "167": "<BAR_13>", "168": "<BAR_14>", "169": "<BAR_15>", "170": "<BAR_16>", "171": "<BAR_17>", "172": "<BAR_18>", "173": "<BAR_19>", "174": "<BAR_20>", "175": "<BAR_21>", "176": "<BAR_22>", "177": "<BAR_23>", "178": "<BAR_24>", "179": "<BAR_25>", "180": "<BAR_26>", "181": "<BAR_27>", "182": "<BAR_28>", "183": "<BAR_29>", "184": "<BAR_30>", "185": "<BAR_31>", "186": "<BAR_32>", "187": "<BEAT_1>", "188": "<BEAT_2>", "189": "<BEAT_3>", "190": "<BEAT_4>", "191": "<POS_0>", "192": "<POS_1>", "193": "<POS_2>", "194": "<POS_3>", "195": "<POS_4>", "196": "<POS_5>", "197": "<POS_6>", "198": "<POS_7>", "199": "<POS_8>", "200": "<POS_9>", "201": "<POS_10>", "202": "<POS_11>", "203": "<POS_12>", "204": "<POS_13>", "205": "<POS_14>", "206": "<POS_15>", "207": "<POS_16>", "208": "<POS_17>", "209": "<POS_18>", "210": "<POS_19>", "211": "<POS_20>", "212": "<POS_21>", "213": "<POS_22>", "214": "<POS_23>", "215": "<POS_24>", "216": "<POS_25>", "217": "<POS_26>", "218": "<POS_27>", "219": "<POS_28>", "220": "<POS_29>", "221": "<POS_30>", "222": "<POS_31>", "223": "<PITCH_28>", "224": "<PITCH_29>", "225": "<PITCH_30>", "226": "<PITCH_31>", "227": "<PITCH_32>", "228": "<PITCH_33>", "229": "<PITCH_34>", "230": "<PITCH_35>", "231": "<PITCH_36>", "232": "<PITCH_37>", "233": "<PITCH_38>", "234": "<PITCH_39>", "235": "<PITCH_40>", "236": "<PITCH_41>", "237": "<PITCH_42>", "238": "<PITCH_43>", "239": "<PITCH_44>", "240": "<PITCH_45>", "241": "<PITCH_46>", "242": "<PITCH_47>", "243": "<PITCH_48>", "244": "<PITCH_49>", "245": "<PITCH_50>", "246": "<PITCH_51>", "247": "<PITCH_52>", "248": "<PITCH_53>", "249": "<PITCH_54>", "250": "<PITCH_55>", "251": "<PITCH_56>", "252": "<PITCH_57>", "253": "<PITCH_58>", "254": "<PITCH_59>", "255": "<PITCH_60>", "256": "<PITCH_61>", "257": "<PITCH_62>", "258": "<PITCH_63>", "259": "<PITCH_64>", "260": "<PITCH_65>", "261": "<PITCH_66>", "262": "<PITCH_67>", "263": "<PITCH_68>", "264": "<PITCH_69>", "265": "<PITCH_70>", "266": "<PITCH_71>", "267": "<PITCH_72>", "268": "<PITCH_73>", "269": "<PITCH_74>", "270": "<PITCH_75>", "271": "<PITCH_76>", "272": "<PITCH_77>", "273": "<PITCH_78>", "274": "<PITCH_79>", "275": "<PITCH_80>", "276": "<PITCH_81>", "277": "<PITCH_82>", "278": "<PITCH_83>", "279": "<PITCH_84>", "280": "<PITCH_85>", "281": "<PITCH_86>", "282": "<PITCH_87>", "283": "<PITCH_88>", "284": "<PITCH_89>", "285": "<PITCH_90>", "286": "<PITCH_91>", "287": "<PITCH_92>", "288": "<PITCH_93>", "289": "<PITCH_94>", "290": "<PITCH_95>", "291": "<PITCH_96>", "292": "<PITCH_97>", "293": "<PITCH_98>", "294": "<PITCH_99>", "295": "<PITCH_100>", "296": "<PITCH_101>", "297": "<PITCH_102>", "298": "<PITCH_103>", "299": "<PITCH_104>", "300": "<PITCH_105>", "301": "<PITCH_106>", "302": "<PITCH_107>", "303": "<PITCH_108>", "304": "<REST>", "305": "<DUR_1>", "306": "<DUR_2>", "307": "<DUR_3>", "308": "<DUR_4>", "309": "<DUR_6>", "310": "<DUR_8>", "311": "<DUR_12>", "312": "<DUR_16>", "313": "<DUR_T2>", "314": "<DUR_T4>", "315": "<VEL_16>", "316": "<VEL_32>", "317": "<VEL_48>", "318": "<VEL_64>", "319": "<VEL_80>", "320": "<VEL_96>", "321": "<VEL_112>", "322": "<VEL_127>", "323": "<NOTE_ON_28>", "324": "<NOTE_ON_29>", "325": "<NOTE_ON_30>", "326": "<NOTE_ON_31>", "327": "<NOTE_ON_32>", "328": "<NOTE_ON_33>", "329": "<NOTE_ON_34>", "330": "<NOTE_ON_35>", "331": "<NOTE_ON_36>", "332": "<NOTE_ON_37>", "333": "<NOTE_ON_38>", "334": "<NOTE_ON_39>", "335": "<NOTE_ON_40>", "336": "<NOTE_ON_41>", "337": "<NOTE_ON_42>", "338": "<NOTE_ON_43>", "339": "<NOTE_ON_44>", "340": "<NOTE_ON_45>", "341": "<NOTE_ON_46>", "342": "<NOTE_ON_47>", "343": "<NOTE_ON_48>", "344": "<NOTE_ON_49>", "345": "<NOTE_ON_50>", "346": "<NOTE_ON_51>", "347": "<NOTE_ON_52>", "348": "<NOTE_ON_53>", "349": "<NOTE_ON_54>", "350": "<NOTE_ON_55>", "351": "<NOTE_ON_56>", "352": "<NOTE_ON_57>", "353": "<NOTE_ON_58>", "354": "<NOTE_ON_59>", "355": "<NOTE_ON_60>", "356": "<NOTE_ON_61>", "357": "<NOTE_ON_62>", "358": "<NOTE_ON_63>", "359": "<NOTE_ON_64>", "360": "<NOTE_ON_65>", "361": "<NOTE_ON_66>", "362": "<NOTE_ON_67>", "363": "<NOTE_ON_68>", "364": "<NOTE_ON_69>", "365": "<NOTE_ON_70>", "366": "<NOTE_ON_71>", "367": "<NOTE_ON_72>", "368": "<NOTE_ON_73>", "369": "<NOTE_ON_74>", "370": "<NOTE_ON_75>", "371": "<NOTE_ON_76>", "372": "<NOTE_ON_77>", "373": "<NOTE_ON_78>", "374": "<NOTE_ON_79>", "375": "<NOTE_ON_80>", "376": "<NOTE_ON_81>", "377": "<NOTE_ON_82>", "378": "<NOTE_ON_83>", "379": "<NOTE_ON_84>", "380": "<NOTE_ON_85>", "381": "<NOTE_ON_86>", "382": "<NOTE_ON_87>", "383": "<NOTE_ON_88>", "384": "<NOTE_ON_89>", "385": "<NOTE_ON_90>", "386": "<NOTE_ON_91>", "387": "<NOTE_ON_92>", "388": "<NOTE_ON_93>", "389": "<NOTE_ON_94>", "390": "<NOTE_ON_95>", "391": "<NOTE_ON_96>", "392": "<NOTE_ON_97>", "393": "<NOTE_ON_98>", "394": "<NOTE_ON_99>", "395": "<NOTE_ON_100>", "396": "<NOTE_ON_101>", "397": "<NOTE_ON_102>", "398": "<NOTE_ON_103>", "399": "<NOTE_ON_104>", "400": "<NOTE_ON_105>", "401": "<NOTE_ON_106>", "402": "<NOTE_ON_107>", "403": "<NOTE_ON_108>", "404": "<NOTE_OFF_28>", "405": "<NOTE_OFF_29>", "406": "<NOTE_OFF_30>", "407": "<NOTE_OFF_31>", "408": "<NOTE_OFF_32>", "409": "<NOTE_OFF_33>", "410": "<NOTE_OFF_34>", "411": "<NOTE_OFF_35>", "412": "<NOTE_OFF_36>", "413": "<NOTE_OFF_37>", "414": "<NOTE_OFF_38>", "415": "<NOTE_OFF_39>", "416": "<NOTE_OFF_40>", "417": "<NOTE_OFF_41>", "418": "<NOTE_OFF_42>", "419": "<NOTE_OFF_43>", "420": "<NOTE_OFF_44>", "421": "<NOTE_OFF_45>", "422": "<NOTE_OFF_46>", "423": "<NOTE_OFF_47>", "424": "<NOTE_OFF_48>", "425": "<NOTE_OFF_49>", "426": "<NOTE_OFF_50>", "427": "<NOTE_OFF_51>", "428": "<NOTE_OFF_52>", "429": "<NOTE_OFF_53>", "430": "<NOTE_OFF_54>", "431": "<NOTE_OFF_55>", "432": "<NOTE_OFF_56>", "433": "<NOTE_OFF_57>", "434": "<NOTE_OFF_58>", "435": "<NOTE_OFF_59>", "436": "<NOTE_OFF_60>", "437": "<NOTE_OFF_61>", "438": "<NOTE_OFF_62>", "439": "<NOTE_OFF_63>", "440": "<NOTE_OFF_64>", "441": "<NOTE_OFF_65>", "442": "<NOTE_OFF_66>", "443": "<NOTE_OFF_67>", "444": "<NOTE_OFF_68>", "445": "<NOTE_OFF_69>", "446": "<NOTE_OFF_70>", "447": "<NOTE_OFF_71>", "448": "<NOTE_OFF_72>", "449": "<NOTE_OFF_73>", "450": "<NOTE_OFF_74>", "451": "<NOTE_OFF_75>", "452": "<NOTE_OFF_76>", "453": "<NOTE_OFF_77>", "454": "<NOTE_OFF_78>", "455": "<NOTE_OFF_79>", "456": "<NOTE_OFF_80>", "457": "<NOTE_OFF_81>", "458": "<NOTE_OFF_82>", "459": "<NOTE_OFF_83>", "460": "<NOTE_OFF_84>", "461": "<NOTE_OFF_85>", "462": "<NOTE_OFF_86>", "463": "<NOTE_OFF_87>", "464": "<NOTE_OFF_88>", "465": "<NOTE_OFF_89>", "466": "<NOTE_OFF_90>", "467": "<NOTE_OFF_91>", "468": "<NOTE_OFF_92>", "469": "<NOTE_OFF_93>", "470": "<NOTE_OFF_94>", "471": "<NOTE_OFF_95>", "472": "<NOTE_OFF_96>", "473": "<NOTE_OFF_97>", "474": "<NOTE_OFF_98>", "475": "<NOTE_OFF_99>", "476": "<NOTE_OFF_100>", "477": "<NOTE_OFF_101>", "478": "<NOTE_OFF_102>", "479": "<NOTE_OFF_103>", "480": "<NOTE_OFF_104>", "481": "<NOTE_OFF_105>", "482": "<NOTE_OFF_106>", "483": "<NOTE_OFF_107>", "484": "<NOTE_OFF_108>", "485": "<TIME_SHIFT_1>", "486": "<TIME_SHIFT_2>", "487": "<TIME_SHIFT_3>", "488": "<TIME_SHIFT_4>", "489": "<TIME_SHIFT_5>", "490": "<TIME_SHIFT_6>", "491": "<TIME_SHIFT_7>", "492": "<TIME_SHIFT_8>", "493": "<TIME_SHIFT_9>", "494": "<TIME_SHIFT_10>", "495": "<TIME_SHIFT_11>", "496": "<TIME_SHIFT_12>", "497": "<TIME_SHIFT_13>", "498": "<TIME_SHIFT_14>", "499": "<TIME_SHIFT_15>", "500": "<TIME_SHIFT_16>", "501": "<TIME_SHIFT_17>", "502": "<TIME_SHIFT_18>", "503": "<TIME_SHIFT_19>", "504": "<TIME_SHIFT_20>", "505": "<TIME_SHIFT_21>", "506": "<TIME_SHIFT_22>", "507": "<TIME_SHIFT_23>", "508": "<TIME_SHIFT_24>", "509": "<TIME_SHIFT_25>", "510": "<TIME_SHIFT_26>", "511": "<TIME_SHIFT_27>", "512": "<TIME_SHIFT_28>", "513": "<TIME_SHIFT_29>", "514": "<TIME_SHIFT_30>", "515": "<TIME_SHIFT_31>", "516": "<TIME_SHIFT_32>", "517": "<VELOCITY_16>", "518": "<VELOCITY_32>", "519": "<VELOCITY_48>", "520": "<VELOCITY_64>", "521": "<VELOCITY_80>", "522": "<VELOCITY_96>", "523": "<VELOCITY_112>", "524": "<VELOCITY_127>"}}